zevero/avr_boot/avr/boards.txt
##############################################################

avr_boot_atmega32u4.name=ATmega32U4

avr_boot_atmega32u4.upload.tool=arduino:avrdude
avr_boot_atmega32u4.upload.maximum_size=28672
avr_boot_atmega32u4.upload.maximum_data_size=2560

avr_boot_atmega32u4.bootloader.tool=arduino:avrdude
avr_boot_atmega32u4.bootloader.high_fuses=0xD8
avr_boot_atmega32u4.bootloader.unlock_bits=0x3F
avr_boot_atmega32u4.bootloader.lock_bits=0x2F

avr_boot_atmega32u4.build.mcu=atmega32u4
avr_boot_atmega32u4.build.core=arduino:arduino
avr_boot_atmega32u4.build.extra_flags={build.usb_flags}
avr_boot_atmega32u4.build.board=AVR_ATMEGA32U4

# Model Menu
avr_boot_atmega32u4.menu.model.leonardo=Leonardo
avr_boot_atmega32u4.menu.model.leonardo.build.vid=0x2341
avr_boot_atmega32u4.menu.model.leonardo.build.pid=0x8036
avr_boot_atmega32u4.menu.model.leonardo.build.usb_product="Arduino Leonardo"
avr_boot_atmega32u4.menu.model.leonardo.build.variant=arduino:leonardo
avr_boot_atmega32u4.menu.model.leonardo.build.board=AVR_LEONARDO

avr_boot_atmega32u4.menu.model.micro=Micro
avr_boot_atmega32u4.menu.model.micro.build.vid=0x2341
avr_boot_atmega32u4.menu.model.micro.build.pid=0x8037
avr_boot_atmega32u4.menu.model.micro.build.usb_product="Arduino Micro"
avr_boot_atmega32u4.menu.model.micro.build.variant=arduino:micro
avr_boot_atmega32u4.menu.model.micro.build.board=AVR_MICRO

avr_boot_atmega32u4.menu.model.esplora=Esplora
avr_boot_atmega32u4.menu.model.esplora.build.vid=0x2341
avr_boot_atmega32u4.menu.model.esplora.build.pid=0x803c
avr_boot_atmega32u4.menu.model.esplora.build.usb_product="Arduino Esplora"
avr_boot_atmega32u4.menu.model.esplora.build.variant=arduino:leonardo
avr_boot_atmega32u4.menu.model.esplora.build.board=AVR_ESPLORA

avr_boot_atmega32u4.menu.model.lilypadusb=LilyPad USB
avr_boot_atmega32u4.menu.model.lilypadusb.build.vid=0x1B4F
avr_boot_atmega32u4.menu.model.lilypadusb.build.pid=0x9208
avr_boot_atmega32u4.menu.model.lilypadusb.build.usb_product="LilyPad USB"
avr_boot_atmega32u4.menu.model.lilypadusb.build.variant=arduino:leonardo
avr_boot_atmega32u4.menu.model.lilypadusb.build.board=AVR_LILYPAD_USB

avr_boot_atmega32u4.menu.model.flora=Flora
avr_boot_atmega32u4.menu.model.flora.build.vid=0x239A
avr_boot_atmega32u4.menu.model.flora.build.pid=0x8004
avr_boot_atmega32u4.menu.model.flora.build.usb_product="Flora"
avr_boot_atmega32u4.menu.model.flora.build.variant=flora
avr_boot_atmega32u4.menu.model.flora.build.board=AVR_FLORA8

avr_boot_atmega32u4.menu.model.bluefruitmicro=Bluefruit Micro
avr_boot_atmega32u4.menu.model.bluefruitmicro.build.vid=0x239A
avr_boot_atmega32u4.menu.model.bluefruitmicro.build.pid=0x800A
avr_boot_atmega32u4.menu.model.bluefruitmicro.build.usb_product="Bluefruit Micro"
avr_boot_atmega32u4.menu.model.bluefruitmicro.build.variant=bluefruitmicro
avr_boot_atmega32u4.menu.model.bluefruitmicro.build.board=AVR_BLUEFRUITMICRO

avr_boot_atmega32u4.menu.model.feather32u4=Feather 32u4
avr_boot_atmega32u4.menu.model.feather32u4.build.vid=0x239A
avr_boot_atmega32u4.menu.model.feather32u4.build.pid=0x800C
avr_boot_atmega32u4.menu.model.feather32u4.build.usb_product="Feather 32u4"
avr_boot_atmega32u4.menu.model.feather32u4.build.variant=feather32u4
avr_boot_atmega32u4.menu.model.feather32u4.build.board=AVR_FEATHER32U4

avr_boot_atmega32u4.menu.model.32u4breakout=Adafruit 32u4 Breakout Configuration
avr_boot_atmega32u4.menu.model.32u4breakout.build.vid=0x239A
avr_boot_atmega32u4.menu.model.32u4breakout.build.pid=0x8001
avr_boot_atmega32u4.menu.model.32u4breakout.build.usb_product="32u4 Breakout"
avr_boot_atmega32u4.menu.model.32u4breakout.build.variant=adafruit32u4
avr_boot_atmega32u4.menu.model.32u4breakout.build.board=AVR_ADAFRUIT32U4

avr_boot_atmega32u4.menu.model.circuitplay32u4cat=Adafruit Circuit Playground 32u4 w/Caterina Configuration
avr_boot_atmega32u4.menu.model.circuitplay32u4cat.build.vid=0x239A
avr_boot_atmega32u4.menu.model.circuitplay32u4cat.build.pid=0x8011
avr_boot_atmega32u4.menu.model.circuitplay32u4cat.build.usb_product="Circuit Playground"
avr_boot_atmega32u4.menu.model.circuitplay32u4cat.build.variant=circuitplay32u4
avr_boot_atmega32u4.menu.model.circuitplay32u4cat.build.board=AVR_CIRCUITPLAY

avr_boot_atmega32u4.menu.model.makeymakey=MaKey MaKey
avr_boot_atmega32u4.menu.model.makeymakey.build.vid=0x1B4F
avr_boot_atmega32u4.menu.model.makeymakey.build.pid=0x2B75
avr_boot_atmega32u4.menu.model.makeymakey.build.usb_product="SparkFun MaKey MaKey"
avr_boot_atmega32u4.menu.model.makeymakey.build.variant=promicro
avr_boot_atmega32u4.menu.model.makeymakey.build.board=AVR_MAKEYMAKEY

avr_boot_atmega32u4.menu.model.promicro=Pro Micro
avr_boot_atmega32u4.menu.model.promicro.build.vid=0x1B4F
avr_boot_atmega32u4.menu.model.promicro.build.pid=0x9206
avr_boot_atmega32u4.menu.model.promicro.build.usb_product="SparkFun Pro Micro"
avr_boot_atmega32u4.menu.model.promicro.build.variant=promicro
avr_boot_atmega32u4.menu.model.promicro.build.board=AVR_PROMICRO

avr_boot_atmega32u4.menu.model.fiov3=Fio v3
avr_boot_atmega32u4.menu.model.fiov3.build.vid=0x1B4F
avr_boot_atmega32u4.menu.model.fiov3.build.pid=0xF101
avr_boot_atmega32u4.menu.model.fiov3.build.usb_product="SparkFun Fio v3"
avr_boot_atmega32u4.menu.model.fiov3.build.variant=promicro
avr_boot_atmega32u4.menu.model.fiov3.build.board=AVR_FIOV3

avr_boot_atmega32u4.menu.model.qduinomini=Qduino Mini
avr_boot_atmega32u4.menu.model.qduinomini.build.vid=0x1B4F
avr_boot_atmega32u4.menu.model.qduinomini.build.pid=0x516D
avr_boot_atmega32u4.menu.model.qduinomini.build.usb_product="Qtechknow Qduino Mini"
avr_boot_atmega32u4.menu.model.qduinomini.build.variant=promicro
avr_boot_atmega32u4.menu.model.qduinomini.build.board=AVR_QDUINOMINI

# Clock Menu
avr_boot_atmega32u4.menu.clock.16mhz=16MHz External
avr_boot_atmega32u4.menu.clock.16mhz.bootloader.low_fuses=0xFF
avr_boot_atmega32u4.menu.clock.16mhz.build.f_cpu=16000000L

avr_boot_atmega32u4.menu.clock.8mhz_external=8MHz External
avr_boot_atmega32u4.menu.clock.8mhz_external.bootloader.low_fuses=0xFF
avr_boot_atmega32u4.menu.clock.8mhz_external.build.f_cpu=8000000L

avr_boot_atmega32u4.menu.clock.8mhz_internal=8MHz Internal
avr_boot_atmega32u4.menu.clock.8mhz_internal.bootloader.low_fuses=0xE2
avr_boot_atmega32u4.menu.clock.8mhz_internal.build.f_cpu=8000000L

# SD CS Pin Menu
avr_boot_atmega32u4.menu.SDCS.4=4
avr_boot_atmega32u4.menu.SDCS.4.cs_pin=4

