zevero/avr_boot/avr/boards.txt
avr_boot_atmega644.build.core=arduino:arduino
avr_boot_atmega644.build.board=AVR_ATMEGA644

# Processor Menu
avr_boot_atmega644.menu.processor.atmega644=ATmega644
avr_boot_atmega644.menu.processor.atmega644.build.mcu=atmega644

avr_boot_atmega644.menu.processor.atmega644p=ATmega644P
avr_boot_atmega644.menu.processor.atmega644p.build.mcu=atmega644p

avr_boot_atmega644.menu.processor.atmega644a=ATmega644A
avr_boot_atmega644.menu.processor.atmega644a.build.mcu=atmega644a

avr_boot_atmega644.menu.processor.atmega644pa=ATmega644PA
avr_boot_atmega644.menu.processor.atmega644pa.build.mcu=atmega644pa

# Pinout Menu
avr_boot_atmega644.menu.pinout.avrdevelopers=avr-developers.com
avr_boot_atmega644.menu.pinout.avrdevelopers.build.variant=avr_developers
avr_boot_atmega644.menu.pinout.avrdevelopers.build.board=1284P_AVR_DEVELOPERS
avr_boot_atmega644.menu.pinout.avrdevelopers.variant_id=0

avr_boot_atmega644.menu.pinout.calunium_pcb=Calunium PCB
avr_boot_atmega644.menu.pinout.calunium_pcb.build.variant=calunium-pcb
avr_boot_atmega644.menu.pinout.calunium_pcb.build.board=AVR_CALUNIUM
avr_boot_atmega644.menu.pinout.calunium_pcb.variant_id=2

avr_boot_atmega644.menu.pinout.calunium_stripboard=Calunium Stripboard
avr_boot_atmega644.menu.pinout.calunium_stripboard.build.variant=calunium-stripboard
avr_boot_atmega644.menu.pinout.calunium_stripboard.build.board=AVR_CALUNIUM
avr_boot_atmega644.menu.pinout.calunium_stripboard.variant_id=2

# The following pinouts require the installation of Mighty 1284P https://github.com/JChristensen/mighty-1284p/tree/v1.6.3)

avr_boot_atmega644.menu.pinout.standard=Standard(requires Mighty1284P): Mighty 1284P/Mighty Mini 1284P
avr_boot_atmega644.menu.pinout.standard.build.variant=mighty-1284p:standard
avr_boot_atmega644.menu.pinout.standard.build.board=1284P_STANDARD
avr_boot_atmega644.menu.pinout.standard.variant_id=0

avr_boot_atmega644.menu.pinout.bobuino=Bobuino(requires Mighty1284P): Bobuino/Skinny Bob
avr_boot_atmega644.menu.pinout.bobuino.build.variant=mighty-1284p:bobuino
avr_boot_atmega644.menu.pinout.bobuino.build.board=1284P_BOBUINO
avr_boot_atmega644.menu.pinout.bobuino.variant_id=1

avr_boot_atmega644.menu.pinout.sleepingbeauty=Sleeping Beauty(requires Mighty1284P)
avr_boot_atmega644.menu.pinout.sleepingbeauty.build.variant=mighty-1284p:sleepingbeauty
avr_boot_atmega644.menu.pinout.sleepingbeauty.build.board=1284P_SLEEPINGBEAUTY
avr_boot_atmega644.menu.pinout.sleepingbeauty.variant_id=2

# Clock Menu
avr_boot_atmega644.menu.clock.16mhz_full_swing=16MHz External Full Swing
avr_boot_atmega644.menu.clock.16mhz_full_swing.bootloader.low_fuses=0xF7
avr_boot_atmega644.menu.clock.16mhz_full_swing.build.f_cpu=16000000L

# Low Power clock setting is more prone to electrical interference
avr_boot_atmega644.menu.clock.16mhz_low_power=16MHz External Low Power
avr_boot_atmega644.menu.clock.16mhz_low_power.bootloader.low_fuses=0xFF
avr_boot_atmega644.menu.clock.16mhz_low_power.build.f_cpu=16000000L

avr_boot_atmega644.menu.clock.20mhz=20MHz External
avr_boot_atmega644.menu.clock.20mhz.bootloader.low_fuses=0xF7
avr_boot_atmega644.menu.clock.20mhz.build.f_cpu=20000000L

avr_boot_atmega644.menu.clock.8mhz_full_swing=8MHz External Full Swing
avr_boot_atmega644.menu.clock.8mhz_full_swing.bootloader.low_fuses=0xF7
avr_boot_atmega644.menu.clock.8mhz_full_swing.build.f_cpu=8000000L

avr_boot_atmega644.menu.clock.8mhz_low_power=8MHz External Low Power
avr_boot_atmega644.menu.clock.8mhz_low_power.bootloader.low_fuses=0xFF
avr_boot_atmega644.menu.clock.8mhz_low_power.build.f_cpu=8000000L

avr_boot_atmega644.menu.clock.8mhz_internal=8MHz Internal
avr_boot_atmega644.menu.clock.8mhz_internal.bootloader.low_fuses=0xE2
avr_boot_atmega644.menu.clock.8mhz_internal.build.f_cpu=8000000L

# SD CS Pin Menu
avr_boot_atmega644.menu.SDCS.4=4
avr_boot_atmega644.menu.SDCS.4.cs_pin=4

avr_boot_atmega644.menu.SDCS.8=8
avr_boot_atmega644.menu.SDCS.8.cs_pin=8

avr_boot_atmega644.menu.SDCS.10=10
avr_boot_atmega644.menu.SDCS.10.cs_pin=10

# BOD Menu
avr_boot_atmega644.menu.BOD.2_7=2.7V
avr_boot_atmega644.menu.BOD.2_7.bootloader.extended_fuses=0xFD

avr_boot_atmega644.menu.BOD.4_3=4.3V
avr_boot_atmega644.menu.BOD.4_3.bootloader.extended_fuses=0xFC

avr_boot_atmega644.menu.BOD.1_8=1.8V
avr_boot_atmega644.menu.BOD.1_8.bootloader.extended_fuses=0xFE

avr_boot_atmega644.menu.BOD.off=Off
avr_boot_atmega644.menu.BOD.off.bootloader.extended_fuses=0xFF

avr_boot_atmega644.bootloader.file={build.mcu}_v{variant_id}_cs{cs_pin}_{build.f_cpu}.hex

##############################################################

avr_boot_atmega324.name=ATmega324P/A/PA

avr_boot_atmega324.upload.tool=arduino:avrdude
avr_boot_atmega324.upload.maximum_data_size=2048
avr_boot_atmega324.upload.maximum_size=28672

avr_boot_atmega324.bootloader.tool=arduino:avrdude
avr_boot_atmega324.bootloader.high_fuses=0xD8
avr_boot_atmega324.bootloader.unlock_bits=0x3F
avr_boot_atmega324.bootloader.lock_bits=0x0F

avr_boot_atmega324.build.core=arduino:arduino
avr_boot_atmega324.build.board=AVR_ATMEGA324

# Processor Menu
avr_boot_atmega324.menu.processor.atmega324p=ATmega324P
avr_boot_atmega324.menu.processor.atmega324p.build.mcu=atmega324p

avr_boot_atmega324.menu.processor.atmega324a=ATmega324A
avr_boot_atmega324.menu.processor.atmega324a.build.mcu=atmega324a

avr_boot_atmega324.menu.processor.atmega324pa=ATmega324PA
avr_boot_atmega324.menu.processor.atmega324pa.build.mcu=atmega324pa

# Pinout Menu
avr_boot_atmega324.menu.pinout.avrdevelopers=avr-developers.com
avr_boot_atmega324.menu.pinout.avrdevelopers.build.variant=avr_developers
avr_boot_atmega324.menu.pinout.avrdevelopers.build.board=1284P_AVR_DEVELOPERS
avr_boot_atmega324.menu.pinout.avrdevelopers.variant_id=0

avr_boot_atmega324.menu.pinout.calunium_pcb=Calunium PCB
avr_boot_atmega324.menu.pinout.calunium_pcb.build.variant=calunium-pcb
avr_boot_atmega324.menu.pinout.calunium_pcb.build.board=AVR_CALUNIUM
avr_boot_atmega324.menu.pinout.calunium_pcb.variant_id=2

avr_boot_atmega324.menu.pinout.calunium_stripboard=Calunium Stripboard
avr_boot_atmega324.menu.pinout.calunium_stripboard.build.variant=calunium-stripboard
avr_boot_atmega324.menu.pinout.calunium_stripboard.build.board=AVR_CALUNIUM
avr_boot_atmega324.menu.pinout.calunium_stripboard.variant_id=2

# The following pinouts require the installation of Mighty 1284P https://github.com/JChristensen/mighty-1284p/tree/v1.6.3)

avr_boot_atmega324.menu.pinout.standard=Standard(requires Mighty1284P): Mighty 1284P/Mighty Mini 1284P
avr_boot_atmega324.menu.pinout.standard.build.variant=mighty-1284p:standard
avr_boot_atmega324.menu.pinout.standard.build.board=1284P_STANDARD
avr_boot_atmega324.menu.pinout.standard.variant_id=0

avr_boot_atmega324.menu.pinout.bobuino=Bobuino(requires Mighty1284P): Bobuino/Skinny Bob
avr_boot_atmega324.menu.pinout.bobuino.build.variant=mighty-1284p:bobuino
avr_boot_atmega324.menu.pinout.bobuino.build.board=1284P_BOBUINO
avr_boot_atmega324.menu.pinout.bobuino.variant_id=1

avr_boot_atmega324.menu.pinout.sleepingbeauty=Sleeping Beauty(requires Mighty1284P)
avr_boot_atmega324.menu.pinout.sleepingbeauty.build.variant=mighty-1284p:sleepingbeauty
avr_boot_atmega324.menu.pinout.sleepingbeauty.build.board=1284P_SLEEPINGBEAUTY
avr_boot_atmega324.menu.pinout.sleepingbeauty.variant_id=2

